# THIS FILE IS AUTOMATICALLY GENERATED
# Project: \\psf\Home\Desktop\USB-Audio-PSOC5LP\Firmware\KitProg version 2_03\KitProg\KitProg_Bootloader.cydsn\KitProg_Bootloader.cyprj
# Date: Fri, 28 Aug 2015 22:15:23 GMT
#set_units -time ns
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {Clock_LED_1} -source [get_pins {ClockBlock/clk_sync}] -edges {1 961 1921} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]


# Component constraints for \\psf\Home\Desktop\USB-Audio-PSOC5LP\Firmware\KitProg version 2_03\KitProg\KitProg_Bootloader.cydsn\TopDesign\TopDesign.cysch
# Project: \\psf\Home\Desktop\USB-Audio-PSOC5LP\Firmware\KitProg version 2_03\KitProg\KitProg_Bootloader.cydsn\KitProg_Bootloader.cyprj
# Date: Fri, 28 Aug 2015 22:15:17 GMT
